src/Reports/ОтчетПоШаблонамТехОпераций/ОтчетПоШаблонамТехОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоШаблонамТехОпераций</name>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчетПоШаблонамТехОпераций/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок = Новый ТабличныйДокумент;
Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблРабочееМесто = Макет.ПолучитьОбласть("РабочееМесто");
ОблТО = Макет.ПолучитьОбласть("ТО");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = Формат(Отчет.НаДату,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.Линейка = Отчет.Линейка;
ТабДок.Вывести(ОблШапка);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеекТехОперации.Ссылка КАК Ссылка,
	|	РабочиеМестаЛинеекТехОперации.ТехОперация
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек.ТехОперации КАК РабочиеМестаЛинеекТехОперации
	|ГДЕ
	|	РабочиеМестаЛинеекТехОперации.Ссылка.Линейка = &Линейка
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочиеМестаЛинеекТехОперации.Ссылка.Код,
	|	РабочиеМестаЛинеекТехОперации.ТехОперация.Наименование
	|ИТОГИ ПО
	|	Ссылка";
Запрос.УстановитьПараметр("Линейка", Отчет.Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаРМ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРМ.Следующий() Цикл
	ОблРабочееМесто.Параметры.РабочееМесто = ВыборкаРМ.Ссылка;
	ТабДок.Вывести(ОблРабочееМесто);
	ТабДок.НачатьГруппуСтрок("РабочееМесто",Истина);
	ВыборкаДетальныеЗаписи = ВыборкаРМ.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ТехОперация.ЭтоГруппа Тогда			
			Выборка = Справочники.ТехОперации.ВыбратьИерархически(ВыборкаДетальныеЗаписи.ТехОперация);
				Пока Выборка.Следующий() Цикл
				НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("ТехОперация",Выборка.Ссылка));
				ОблТО.Параметры.ТО = Выборка.Ссылка;
				ОблТО.Параметры.НормаВремени = НормыТО.Норма;
				ОблТО.Параметры.Тариф = НормыТО.Стоимость;
				ТабДок.Вывести(ОблТО);				
				КонецЦикла;			
			Иначе
			НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("ТехОперация",ВыборкаДетальныеЗаписи.ТехОперация));	
			ОблТО.Параметры.ТО = ВыборкаДетальныеЗаписи.ТехОперация;
			ОблТО.Параметры.НормаВремени = НормыТО.Норма;
			ОблТО.Параметры.Тариф = НормыТО.Стоимость;
			ТабДок.Вывести(ОблТО);			
			КонецЕсли;
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.НаДату = ТекущаяДата();
	Если Параметры.Свойство("Линейка") Тогда
	Отчет.Линейка = Параметры.Линейка;
	СформироватьНаСервере();	
	КонецЕсли; 
КонецПроцедуры
